Revit 2026 API

# ModelTextSetVisibility Method

---

Sets the visibility for the model text in a family document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetVisibility(
	FamilyElementVisibility visibility
)
```
```vb
Public Sub SetVisibility (
	visibility As FamilyElementVisibility
)
```
```cpp
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
```
```fsharp
member SetVisibility :
        visibility : FamilyElementVisibility -> unit
```

#### Parameters

visibility FamilyElementVisibility

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when visibility is . |
| InvalidOperationException | Thrown when regeneration failed, or the model curve is in a project document. |

The visibility of the model text geometry can be changed for different types of views and detail levels in the family document.

#### Reference

ModelText Class

Autodesk.Revit.DB Namespace